IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
<module name="CONTROLSS_CTRL_CONTROLSS_CTRL" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_CTRL_PID" acronym="CONTROLSS_CTRL_PID" offset="0x0" width="32" description="">
		<bitfield id="PID_MSB16" width="16" begin="31" end="16" resetval="0x24960" description="Not Defined" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="PID_MISC" width="5" begin="15" end="11" resetval="0x0" description="Not Defined" range="15 - 11" rwaccess="RO"/> 
		<bitfield id="PID_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Not Defined" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="PID_CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Not Defined" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="PID_MINOR" width="6" begin="5" end="0" resetval="0x20" description="Not Defined" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL0" acronym="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL0" offset="0x4" width="32" description="">
		<bitfield id="ETPWM15" width="2" begin="31" end="30" resetval="0x0" description="ETPWM15 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="31 - 30" rwaccess="RW"/> 
		<bitfield id="ETPWM14" width="2" begin="29" end="28" resetval="0x0" description="ETPWM14 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="29 - 28" rwaccess="RW"/> 
		<bitfield id="ETPWM13" width="2" begin="27" end="26" resetval="0x0" description="ETPWM13 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="27 - 26" rwaccess="RW"/> 
		<bitfield id="ETPWM12" width="2" begin="25" end="24" resetval="0x0" description="ETPWM12 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="25 - 24" rwaccess="RW"/> 
		<bitfield id="ETPWM11" width="2" begin="23" end="22" resetval="0x0" description="ETPWM11 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="23 - 22" rwaccess="RW"/> 
		<bitfield id="ETPWM10" width="2" begin="21" end="20" resetval="0x0" description="ETPWM10 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="21 - 20" rwaccess="RW"/> 
		<bitfield id="ETPWM9" width="2" begin="19" end="18" resetval="0x0" description="ETPWM9 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="19 - 18" rwaccess="RW"/> 
		<bitfield id="ETPWM8" width="2" begin="17" end="16" resetval="0x0" description="ETPWM8 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="17 - 16" rwaccess="RW"/> 
		<bitfield id="ETPWM7" width="2" begin="15" end="14" resetval="0x0" description="ETPWM7 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="15 - 14" rwaccess="RW"/> 
		<bitfield id="ETPWM6" width="2" begin="13" end="12" resetval="0x0" description="ETPWM6 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="ETPWM5" width="2" begin="11" end="10" resetval="0x0" description="ETPWM5 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="ETPWM4" width="2" begin="9" end="8" resetval="0x0" description="ETPWM4 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="ETPWM3" width="2" begin="7" end="6" resetval="0x0" description="ETPWM3 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="7 - 6" rwaccess="RW"/> 
		<bitfield id="ETPWM2" width="2" begin="5" end="4" resetval="0x0" description="ETPWM2 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="ETPWM1" width="2" begin="3" end="2" resetval="0x0" description="ETPWM1 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="ETPWM0" width="2" begin="1" end="0" resetval="0x0" description="ETPWM0 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL1" acronym="CONTROLSS_CTRL_EPWM_STATICXBAR_SEL1" offset="0x8" width="32" description="">
		<bitfield id="ETPWM31" width="2" begin="31" end="30" resetval="0x0" description="ETPWM31 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="31 - 30" rwaccess="RW"/> 
		<bitfield id="ETPWM30" width="2" begin="29" end="28" resetval="0x0" description="ETPWM30 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="29 - 28" rwaccess="RW"/> 
		<bitfield id="ETPWM29" width="2" begin="27" end="26" resetval="0x0" description="ETPWM29 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="27 - 26" rwaccess="RW"/> 
		<bitfield id="ETPWM28" width="2" begin="25" end="24" resetval="0x0" description="ETPWM28 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="25 - 24" rwaccess="RW"/> 
		<bitfield id="ETPWM27" width="2" begin="23" end="22" resetval="0x0" description="ETPWM27 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="23 - 22" rwaccess="RW"/> 
		<bitfield id="ETPWM26" width="2" begin="21" end="20" resetval="0x0" description="ETPWM26 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="21 - 20" rwaccess="RW"/> 
		<bitfield id="ETPWM25" width="2" begin="19" end="18" resetval="0x0" description="ETPWM25 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="19 - 18" rwaccess="RW"/> 
		<bitfield id="ETPWM24" width="2" begin="17" end="16" resetval="0x0" description="ETPWM24 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="17 - 16" rwaccess="RW"/> 
		<bitfield id="ETPWM23" width="2" begin="15" end="14" resetval="0x0" description="ETPWM23 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="15 - 14" rwaccess="RW"/> 
		<bitfield id="ETPWM22" width="2" begin="13" end="12" resetval="0x0" description="ETPWM22 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="ETPWM21" width="2" begin="11" end="10" resetval="0x0" description="ETPWM21 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="11 - 10" rwaccess="RW"/> 
		<bitfield id="ETPWM20" width="2" begin="9" end="8" resetval="0x0" description="ETPWM20 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="9 - 8" rwaccess="RW"/> 
		<bitfield id="ETPWM19" width="2" begin="7" end="6" resetval="0x0" description="ETPWM19 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="7 - 6" rwaccess="RW"/> 
		<bitfield id="ETPWM18" width="2" begin="5" end="4" resetval="0x0" description="ETPWM18 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="5 - 4" rwaccess="RW"/> 
		<bitfield id="ETPWM17" width="2" begin="3" end="2" resetval="0x0" description="ETPWM17 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="3 - 2" rwaccess="RW"/> 
		<bitfield id="ETPWM16" width="2" begin="1" end="0" resetval="0x0" description="ETPWM16 access from PCR grouping -  00 = G0, 01 = G1, 01 = G2, 11 = G3" range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM_CLKSYNC" acronym="CONTROLSS_CTRL_EPWM_CLKSYNC" offset="0x10" width="32" description="">
		<bitfield id="BIT" width="32" begin="31" end="0" resetval="0x0" description="ETPWM clock sync for each EPWM instance1: will allow CLK SYNC when GBCLKSYNC is written in0: No CLK SYNC when GBCLKSYNC is written in" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_SDFM1_CLK0_SEL" acronym="CONTROLSS_CTRL_SDFM1_CLK0_SEL" offset="0x18" width="0" description="">
		<bitfield id="SEL" width="1" begin="0" end="0" resetval="0x0" description="SDFM1 clock CK0 select0: source is SDFM1 CK0 from Pinmux1: source is SDFM0 CK0 from Pinmux" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EMUSTOPN_MASK" acronym="CONTROLSS_CTRL_EMUSTOPN_MASK" offset="0x20" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM0: CR5B1 enabled to control EMUSTOPn1: CR5B1 disabled to control EMUSTOPn" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM0: CR5A1 enabled to control EMUSTOPn1: CR5A1 disabled to control EMUSTOPn" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM0: CR5B0 enabled to control EMUSTOPn1: CR5B0 disabled to control EMUSTOPn" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="Bit-mask for debug suspend cpu cores to EPWM0: CR5A0 enabled to control EMUSTOPn1: CR5A0 disabled to control EMUSTOPn" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CLB_AQ_EN0" acronym="CONTROLSS_CTRL_CLB_AQ_EN0" offset="0x28" width="32" description="">
		<bitfield id="ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_AQ signal of PWM[15:0]" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CLB_AQ_EN1" acronym="CONTROLSS_CTRL_CLB_AQ_EN1" offset="0x30" width="32" description="">
		<bitfield id="ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_AQ signal of PWM[31:16]" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CLB_DB_EN0" acronym="CONTROLSS_CTRL_CLB_DB_EN0" offset="0x38" width="32" description="">
		<bitfield id="ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_DB signal of PWM[15:0]" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CLB_DB_EN1" acronym="CONTROLSS_CTRL_CLB_DB_EN1" offset="0x40" width="32" description="">
		<bitfield id="ENABLE" width="32" begin="31" end="0" resetval="0x0" description="Enable ICCS control to CLB_DB signal of PWM[31:16]" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM0_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM0_CLK_GATE" offset="0x100" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM1_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM1_CLK_GATE" offset="0x104" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM2_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM2_CLK_GATE" offset="0x108" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM3_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM3_CLK_GATE" offset="0x10C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM4_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM4_CLK_GATE" offset="0x110" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM5_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM5_CLK_GATE" offset="0x114" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM6_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM6_CLK_GATE" offset="0x118" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM7_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM7_CLK_GATE" offset="0x11C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM8_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM8_CLK_GATE" offset="0x120" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM9_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM9_CLK_GATE" offset="0x124" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
