IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_ETPWM10_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM10_CLK_GATE" offset="0x128" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM11_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM11_CLK_GATE" offset="0x12C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM12_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM12_CLK_GATE" offset="0x130" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM13_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM13_CLK_GATE" offset="0x134" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM14_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM14_CLK_GATE" offset="0x138" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM15_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM15_CLK_GATE" offset="0x13C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM16_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM16_CLK_GATE" offset="0x140" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM17_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM17_CLK_GATE" offset="0x144" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM18_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM18_CLK_GATE" offset="0x148" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM19_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM19_CLK_GATE" offset="0x14C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM20_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM20_CLK_GATE" offset="0x150" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM21_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM21_CLK_GATE" offset="0x154" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM22_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM22_CLK_GATE" offset="0x158" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM23_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM23_CLK_GATE" offset="0x15C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM24_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM24_CLK_GATE" offset="0x160" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM25_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM25_CLK_GATE" offset="0x164" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM26_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM26_CLK_GATE" offset="0x168" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM27_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM27_CLK_GATE" offset="0x16C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM28_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM28_CLK_GATE" offset="0x170" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM29_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM29_CLK_GATE" offset="0x174" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM30_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM30_CLK_GATE" offset="0x178" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM31_CLK_GATE" acronym="CONTROLSS_CTRL_ETPWM31_CLK_GATE" offset="0x17C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX0_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX0_CLK_GATE" offset="0x180" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi_tx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX1_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX1_CLK_GATE" offset="0x184" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi_tx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX2_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX2_CLK_GATE" offset="0x188" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi_tx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX3_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX3_CLK_GATE" offset="0x18C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi_tx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_RX0_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX0_CLK_GATE" offset="0x190" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi_rx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_RX1_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX1_CLK_GATE" offset="0x194" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi_rx" range="2 - 0" rwaccess="RW"/>
	</register>
