IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_FSI_RX2_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX2_CLK_GATE" offset="0x198" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi_rx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_RX3_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_RX3_CLK_GATE" offset="0x19C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi_rx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA0_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA0_CLK_GATE" offset="0x1A0" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA1_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA1_CLK_GATE" offset="0x1A4" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA2_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA2_CLK_GATE" offset="0x1A8" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA3_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA3_CLK_GATE" offset="0x1AC" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA4_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA4_CLK_GATE" offset="0x1B0" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA5_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA5_CLK_GATE" offset="0x1B4" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA6_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA6_CLK_GATE" offset="0x1B8" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA7_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA7_CLK_GATE" offset="0x1BC" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA8_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA8_CLK_GATE" offset="0x1C0" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA9_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSA9_CLK_GATE" offset="0x1C4" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB0_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB0_CLK_GATE" offset="0x1D0" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB1_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB1_CLK_GATE" offset="0x1D4" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB2_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB2_CLK_GATE" offset="0x1D8" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB3_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB3_CLK_GATE" offset="0x1DC" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB4_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB4_CLK_GATE" offset="0x1E0" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB5_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB5_CLK_GATE" offset="0x1E4" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB6_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB6_CLK_GATE" offset="0x1E8" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
