IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_CMPSSB7_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB7_CLK_GATE" offset="0x1EC" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB8_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB8_CLK_GATE" offset="0x1F0" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB9_CLK_GATE" acronym="CONTROLSS_CTRL_CMPSSB9_CLK_GATE" offset="0x1F4" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP0_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP0_CLK_GATE" offset="0x200" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP1_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP1_CLK_GATE" offset="0x204" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP2_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP2_CLK_GATE" offset="0x208" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP3_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP3_CLK_GATE" offset="0x20C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP4_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP4_CLK_GATE" offset="0x210" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP5_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP5_CLK_GATE" offset="0x214" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP6_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP6_CLK_GATE" offset="0x218" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP7_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP7_CLK_GATE" offset="0x21C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP8_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP8_CLK_GATE" offset="0x220" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP9_CLK_GATE" acronym="CONTROLSS_CTRL_ECAP9_CLK_GATE" offset="0x224" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EQEP0_CLK_GATE" acronym="CONTROLSS_CTRL_EQEP0_CLK_GATE" offset="0x240" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding eqep" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EQEP1_CLK_GATE" acronym="CONTROLSS_CTRL_EQEP1_CLK_GATE" offset="0x244" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding eqep" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EQEP2_CLK_GATE" acronym="CONTROLSS_CTRL_EQEP2_CLK_GATE" offset="0x248" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding eqep" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_SDFM0_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM0_CLK_GATE" offset="0x250" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding sdfm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_SDFM1_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM1_CLK_GATE" offset="0x254" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding sdfm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_DAC_CLK_GATE" acronym="CONTROLSS_CTRL_DAC_CLK_GATE" offset="0x258" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for dac" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ADC0_CLK_GATE" acronym="CONTROLSS_CTRL_ADC0_CLK_GATE" offset="0x25C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
