IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_ADC1_CLK_GATE" acronym="CONTROLSS_CTRL_ADC1_CLK_GATE" offset="0x260" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ADC2_CLK_GATE" acronym="CONTROLSS_CTRL_ADC2_CLK_GATE" offset="0x264" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ADC3_CLK_GATE" acronym="CONTROLSS_CTRL_ADC3_CLK_GATE" offset="0x268" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ADC4_CLK_GATE" acronym="CONTROLSS_CTRL_ADC4_CLK_GATE" offset="0x26C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_OTTO0_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO0_CLK_GATE" offset="0x270" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding otto" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_OTTO1_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO1_CLK_GATE" offset="0x274" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding otto" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_OTTO2_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO2_CLK_GATE" offset="0x278" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding otto" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_OTTO3_CLK_GATE" acronym="CONTROLSS_CTRL_OTTO3_CLK_GATE" offset="0x27C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding otto" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_SDFM0_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM0_PLL_CLK_GATE" offset="0x280" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding sdfm pll clock" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_SDFM1_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_SDFM1_PLL_CLK_GATE" offset="0x284" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding sdfm pll clock" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX0_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX0_PLL_CLK_GATE" offset="0x288" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi rx pll clock" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX1_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX1_PLL_CLK_GATE" offset="0x28C" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi rx pll clock" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX2_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX2_PLL_CLK_GATE" offset="0x290" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi rx pll clock" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX3_PLL_CLK_GATE" acronym="CONTROLSS_CTRL_FSI_TX3_PLL_CLK_GATE" offset="0x294" width="8" description="">
		<bitfield id="CLK_GATE" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will gate clock for corresponding fsi rx pll clock" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM0_RST" acronym="CONTROLSS_CTRL_ETPWM0_RST" offset="0x300" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM1_RST" acronym="CONTROLSS_CTRL_ETPWM1_RST" offset="0x304" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM2_RST" acronym="CONTROLSS_CTRL_ETPWM2_RST" offset="0x308" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM3_RST" acronym="CONTROLSS_CTRL_ETPWM3_RST" offset="0x30C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM4_RST" acronym="CONTROLSS_CTRL_ETPWM4_RST" offset="0x310" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM5_RST" acronym="CONTROLSS_CTRL_ETPWM5_RST" offset="0x314" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM6_RST" acronym="CONTROLSS_CTRL_ETPWM6_RST" offset="0x318" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM7_RST" acronym="CONTROLSS_CTRL_ETPWM7_RST" offset="0x31C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
