IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_ETPWM8_RST" acronym="CONTROLSS_CTRL_ETPWM8_RST" offset="0x320" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM9_RST" acronym="CONTROLSS_CTRL_ETPWM9_RST" offset="0x324" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM10_RST" acronym="CONTROLSS_CTRL_ETPWM10_RST" offset="0x328" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM11_RST" acronym="CONTROLSS_CTRL_ETPWM11_RST" offset="0x32C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM12_RST" acronym="CONTROLSS_CTRL_ETPWM12_RST" offset="0x330" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM13_RST" acronym="CONTROLSS_CTRL_ETPWM13_RST" offset="0x334" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM14_RST" acronym="CONTROLSS_CTRL_ETPWM14_RST" offset="0x338" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM15_RST" acronym="CONTROLSS_CTRL_ETPWM15_RST" offset="0x33C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM16_RST" acronym="CONTROLSS_CTRL_ETPWM16_RST" offset="0x340" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM17_RST" acronym="CONTROLSS_CTRL_ETPWM17_RST" offset="0x344" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM18_RST" acronym="CONTROLSS_CTRL_ETPWM18_RST" offset="0x348" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM19_RST" acronym="CONTROLSS_CTRL_ETPWM19_RST" offset="0x34C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM20_RST" acronym="CONTROLSS_CTRL_ETPWM20_RST" offset="0x350" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM21_RST" acronym="CONTROLSS_CTRL_ETPWM21_RST" offset="0x354" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM22_RST" acronym="CONTROLSS_CTRL_ETPWM22_RST" offset="0x358" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM23_RST" acronym="CONTROLSS_CTRL_ETPWM23_RST" offset="0x35C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM24_RST" acronym="CONTROLSS_CTRL_ETPWM24_RST" offset="0x360" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM25_RST" acronym="CONTROLSS_CTRL_ETPWM25_RST" offset="0x364" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM26_RST" acronym="CONTROLSS_CTRL_ETPWM26_RST" offset="0x368" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM27_RST" acronym="CONTROLSS_CTRL_ETPWM27_RST" offset="0x36C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM28_RST" acronym="CONTROLSS_CTRL_ETPWM28_RST" offset="0x370" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
