IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_ETPWM29_RST" acronym="CONTROLSS_CTRL_ETPWM29_RST" offset="0x374" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM30_RST" acronym="CONTROLSS_CTRL_ETPWM30_RST" offset="0x378" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ETPWM31_RST" acronym="CONTROLSS_CTRL_ETPWM31_RST" offset="0x37C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding etpwm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX0_RST" acronym="CONTROLSS_CTRL_FSI_TX0_RST" offset="0x380" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding fsi_tx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX1_RST" acronym="CONTROLSS_CTRL_FSI_TX1_RST" offset="0x384" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding fsi_tx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX2_RST" acronym="CONTROLSS_CTRL_FSI_TX2_RST" offset="0x388" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding fsi_tx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_TX3_RST" acronym="CONTROLSS_CTRL_FSI_TX3_RST" offset="0x38C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding fsi_tx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_RX0_RST" acronym="CONTROLSS_CTRL_FSI_RX0_RST" offset="0x390" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding fsi_rx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_RX1_RST" acronym="CONTROLSS_CTRL_FSI_RX1_RST" offset="0x394" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding fsi_rx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_RX2_RST" acronym="CONTROLSS_CTRL_FSI_RX2_RST" offset="0x398" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding fsi_rx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FSI_RX3_RST" acronym="CONTROLSS_CTRL_FSI_RX3_RST" offset="0x39C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding fsi_rx" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA0_RST" acronym="CONTROLSS_CTRL_CMPSSA0_RST" offset="0x3A0" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA1_RST" acronym="CONTROLSS_CTRL_CMPSSA1_RST" offset="0x3A4" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA2_RST" acronym="CONTROLSS_CTRL_CMPSSA2_RST" offset="0x3A8" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA3_RST" acronym="CONTROLSS_CTRL_CMPSSA3_RST" offset="0x3AC" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA4_RST" acronym="CONTROLSS_CTRL_CMPSSA4_RST" offset="0x3B0" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA5_RST" acronym="CONTROLSS_CTRL_CMPSSA5_RST" offset="0x3B4" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA6_RST" acronym="CONTROLSS_CTRL_CMPSSA6_RST" offset="0x3B8" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA7_RST" acronym="CONTROLSS_CTRL_CMPSSA7_RST" offset="0x3BC" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA8_RST" acronym="CONTROLSS_CTRL_CMPSSA8_RST" offset="0x3C0" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSA9_RST" acronym="CONTROLSS_CTRL_CMPSSA9_RST" offset="0x3C4" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss12b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB0_RST" acronym="CONTROLSS_CTRL_CMPSSB0_RST" offset="0x3D0" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB1_RST" acronym="CONTROLSS_CTRL_CMPSSB1_RST" offset="0x3D4" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB2_RST" acronym="CONTROLSS_CTRL_CMPSSB2_RST" offset="0x3D8" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB3_RST" acronym="CONTROLSS_CTRL_CMPSSB3_RST" offset="0x3DC" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB4_RST" acronym="CONTROLSS_CTRL_CMPSSB4_RST" offset="0x3E0" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB5_RST" acronym="CONTROLSS_CTRL_CMPSSB5_RST" offset="0x3E4" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB6_RST" acronym="CONTROLSS_CTRL_CMPSSB6_RST" offset="0x3E8" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB7_RST" acronym="CONTROLSS_CTRL_CMPSSB7_RST" offset="0x3EC" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB8_RST" acronym="CONTROLSS_CTRL_CMPSSB8_RST" offset="0x3F0" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
