IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_CMPSSB9_RST" acronym="CONTROLSS_CTRL_CMPSSB9_RST" offset="0x3F4" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding cmpss8b" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP0_RST" acronym="CONTROLSS_CTRL_ECAP0_RST" offset="0x400" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP1_RST" acronym="CONTROLSS_CTRL_ECAP1_RST" offset="0x404" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP2_RST" acronym="CONTROLSS_CTRL_ECAP2_RST" offset="0x408" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP3_RST" acronym="CONTROLSS_CTRL_ECAP3_RST" offset="0x40C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP4_RST" acronym="CONTROLSS_CTRL_ECAP4_RST" offset="0x410" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP5_RST" acronym="CONTROLSS_CTRL_ECAP5_RST" offset="0x414" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP6_RST" acronym="CONTROLSS_CTRL_ECAP6_RST" offset="0x418" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP7_RST" acronym="CONTROLSS_CTRL_ECAP7_RST" offset="0x41C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP8_RST" acronym="CONTROLSS_CTRL_ECAP8_RST" offset="0x420" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP9_RST" acronym="CONTROLSS_CTRL_ECAP9_RST" offset="0x424" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding ecap" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EQEP0_RST" acronym="CONTROLSS_CTRL_EQEP0_RST" offset="0x440" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding eqep" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EQEP1_RST" acronym="CONTROLSS_CTRL_EQEP1_RST" offset="0x444" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding eqep" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EQEP2_RST" acronym="CONTROLSS_CTRL_EQEP2_RST" offset="0x448" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding eqep" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_SDFM0_RST" acronym="CONTROLSS_CTRL_SDFM0_RST" offset="0x450" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding sdfm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_SDFM1_RST" acronym="CONTROLSS_CTRL_SDFM1_RST" offset="0x454" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding sdfm" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_DAC_RST" acronym="CONTROLSS_CTRL_DAC_RST" offset="0x458" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for dac" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ADC0_RST" acronym="CONTROLSS_CTRL_ADC0_RST" offset="0x45C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ADC1_RST" acronym="CONTROLSS_CTRL_ADC1_RST" offset="0x460" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ADC2_RST" acronym="CONTROLSS_CTRL_ADC2_RST" offset="0x464" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ADC3_RST" acronym="CONTROLSS_CTRL_ADC3_RST" offset="0x468" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ADC4_RST" acronym="CONTROLSS_CTRL_ADC4_RST" offset="0x46C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding adc" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_OTTO0_RST" acronym="CONTROLSS_CTRL_OTTO0_RST" offset="0x470" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding otto" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_OTTO1_RST" acronym="CONTROLSS_CTRL_OTTO1_RST" offset="0x474" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding otto" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_OTTO2_RST" acronym="CONTROLSS_CTRL_OTTO2_RST" offset="0x478" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding otto" range="2 - 0" rwaccess="RW"/>
	</register>
