IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_OTTO3_RST" acronym="CONTROLSS_CTRL_OTTO3_RST" offset="0x47C" width="8" description="">
		<bitfield id="RST" width="3" begin="2" end="0" resetval="0x0" description="writing '111' will generate reset for corresponding otto" range="2 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM0_HALTEN" acronym="CONTROLSS_CTRL_EPWM0_HALTEN" offset="0x500" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM1_HALTEN" acronym="CONTROLSS_CTRL_EPWM1_HALTEN" offset="0x504" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM2_HALTEN" acronym="CONTROLSS_CTRL_EPWM2_HALTEN" offset="0x508" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM3_HALTEN" acronym="CONTROLSS_CTRL_EPWM3_HALTEN" offset="0x50C" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM4_HALTEN" acronym="CONTROLSS_CTRL_EPWM4_HALTEN" offset="0x510" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM5_HALTEN" acronym="CONTROLSS_CTRL_EPWM5_HALTEN" offset="0x514" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
