IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_EPWM6_HALTEN" acronym="CONTROLSS_CTRL_EPWM6_HALTEN" offset="0x518" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM7_HALTEN" acronym="CONTROLSS_CTRL_EPWM7_HALTEN" offset="0x51C" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM8_HALTEN" acronym="CONTROLSS_CTRL_EPWM8_HALTEN" offset="0x520" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM9_HALTEN" acronym="CONTROLSS_CTRL_EPWM9_HALTEN" offset="0x524" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM10_HALTEN" acronym="CONTROLSS_CTRL_EPWM10_HALTEN" offset="0x528" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM11_HALTEN" acronym="CONTROLSS_CTRL_EPWM11_HALTEN" offset="0x52C" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM12_HALTEN" acronym="CONTROLSS_CTRL_EPWM12_HALTEN" offset="0x530" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM13_HALTEN" acronym="CONTROLSS_CTRL_EPWM13_HALTEN" offset="0x534" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM14_HALTEN" acronym="CONTROLSS_CTRL_EPWM14_HALTEN" offset="0x538" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM15_HALTEN" acronym="CONTROLSS_CTRL_EPWM15_HALTEN" offset="0x53C" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM16_HALTEN" acronym="CONTROLSS_CTRL_EPWM16_HALTEN" offset="0x540" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
