IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_EPWM17_HALTEN" acronym="CONTROLSS_CTRL_EPWM17_HALTEN" offset="0x544" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM18_HALTEN" acronym="CONTROLSS_CTRL_EPWM18_HALTEN" offset="0x548" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM19_HALTEN" acronym="CONTROLSS_CTRL_EPWM19_HALTEN" offset="0x54C" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM20_HALTEN" acronym="CONTROLSS_CTRL_EPWM20_HALTEN" offset="0x550" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM21_HALTEN" acronym="CONTROLSS_CTRL_EPWM21_HALTEN" offset="0x554" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM22_HALTEN" acronym="CONTROLSS_CTRL_EPWM22_HALTEN" offset="0x558" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM23_HALTEN" acronym="CONTROLSS_CTRL_EPWM23_HALTEN" offset="0x55C" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM24_HALTEN" acronym="CONTROLSS_CTRL_EPWM24_HALTEN" offset="0x560" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM25_HALTEN" acronym="CONTROLSS_CTRL_EPWM25_HALTEN" offset="0x564" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM26_HALTEN" acronym="CONTROLSS_CTRL_EPWM26_HALTEN" offset="0x568" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EPWM27_HALTEN" acronym="CONTROLSS_CTRL_EPWM27_HALTEN" offset="0x56C" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
