IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_CMPSSB5_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB5_HALTEN" offset="0x5BC" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB6_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB6_HALTEN" offset="0x5C0" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB7_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB7_HALTEN" offset="0x5C4" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB8_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB8_HALTEN" offset="0x5C8" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_CMPSSB9_HALTEN" acronym="CONTROLSS_CTRL_CMPSSB9_HALTEN" offset="0x5CC" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP0_HALTEN" acronym="CONTROLSS_CTRL_ECAP0_HALTEN" offset="0x5D0" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP1_HALTEN" acronym="CONTROLSS_CTRL_ECAP1_HALTEN" offset="0x5D4" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_ECAP2_HALTEN" acronym="CONTROLSS_CTRL_ECAP2_HALTEN" offset="0x5D8" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
