IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_EQEP2_HALTEN" acronym="CONTROLSS_CTRL_EQEP2_HALTEN" offset="0x600" width="8" description="">
		<bitfield id="CR5B1" width="1" begin="3" end="3" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="3" rwaccess="RW"/> 
		<bitfield id="CR5A1" width="1" begin="2" end="2" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="2" rwaccess="RW"/> 
		<bitfield id="CR5B0" width="1" begin="1" end="1" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="1" rwaccess="RW"/> 
		<bitfield id="CR5A0" width="1" begin="0" end="0" resetval="0x0" description="1'b0: IP Halt disabled with corresponding CPU halt1'b1: IP Halt enabled with corresponding CPU halt" range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_LOCK0_KICK0" acronym="CONTROLSS_CTRL_LOCK0_KICK0" offset="0x1008" width="32" description="">
		<bitfield id="LOCK0_KICK0" width="32" begin="31" end="0" resetval="0x0" description="- KICK0 component" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_LOCK0_KICK1" acronym="CONTROLSS_CTRL_LOCK0_KICK1" offset="0x100C" width="32" description="">
		<bitfield id="LOCK0_KICK1" width="32" begin="31" end="0" resetval="0x0" description="- KICK1 component" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_INTR_RAW_STATUS" acronym="CONTROLSS_CTRL_INTR_RAW_STATUS" offset="0x1010" width="8" description="">
		<bitfield id="PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="3" rwaccess="RW"/> 
		<bitfield id="KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="2" rwaccess="RW"/> 
		<bitfield id="ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="1" rwaccess="RW"/> 
		<bitfield id="PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Raw status is read. Write a 1 to set the status. Writing a 0 has no effect." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_INTR_ENABLED_STATUS_CLEAR" acronym="CONTROLSS_CTRL_INTR_ENABLED_STATUS_CLEAR" offset="0x1014" width="8" description="">
		<bitfield id="ENABLED_PROXY_ERR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="3" rwaccess="RW"/> 
		<bitfield id="ENABLED_KICK_ERR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="2" rwaccess="RW"/> 
		<bitfield id="ENABLED_ADDR_ERR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="1" rwaccess="RW"/> 
		<bitfield id="ENABLED_PROT_ERR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error. Enabled status is read. Write a 1 to clear the status. Writing a 0 has no effect." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_INTR_ENABLE" acronym="CONTROLSS_CTRL_INTR_ENABLE" offset="0x1018" width="8" description="">
		<bitfield id="PROXY_ERR_EN" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="3" rwaccess="RW"/> 
		<bitfield id="KICK_ERR_EN" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="2" rwaccess="RW"/> 
		<bitfield id="ADDR_ERR_EN" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="1" rwaccess="RW"/> 
		<bitfield id="PROT_ERR_EN" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable. Write a 1 to set the enable. Writing a 0 has no effect." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_INTR_ENABLE_CLEAR" acronym="CONTROLSS_CTRL_INTR_ENABLE_CLEAR" offset="0x101C" width="8" description="">
		<bitfield id="PROXY_ERR_EN_CLR" width="1" begin="3" end="3" resetval="0x0" description="Proxy0 access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="3" rwaccess="RW"/> 
		<bitfield id="KICK_ERR_EN_CLR" width="1" begin="2" end="2" resetval="0x0" description="Kick access violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="2" rwaccess="RW"/> 
		<bitfield id="ADDR_ERR_EN_CLR" width="1" begin="1" end="1" resetval="0x0" description="Addressing violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="1" rwaccess="RW"/> 
		<bitfield id="PROT_ERR_EN_CLR" width="1" begin="0" end="0" resetval="0x0" description="Protection violation error enable clear. Write a 1 to clear the enable. Writing a 0 has no effect." range="0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_EOI" acronym="CONTROLSS_CTRL_EOI" offset="0x1020" width="8" description="">
		<bitfield id="EOI_VECTOR" width="8" begin="7" end="0" resetval="0x0" description="EOI vector value. Write this with interrupt distribution value in the chip." range="7 - 0" rwaccess="RW"/>
	</register>
	<register id="CONTROLSS_CTRL_FAULT_ADDRESS" acronym="CONTROLSS_CTRL_FAULT_ADDRESS" offset="0x1024" width="32" description="">
		<bitfield id="FAULT_ADDR" width="32" begin="31" end="0" resetval="0x0" description="Fault Address." range="31 - 0" rwaccess="RO"/>
	</register>
