IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_CTRL_CONTROLSS_CTRL.xml
	<register id="CONTROLSS_CTRL_FAULT_TYPE_STATUS" acronym="CONTROLSS_CTRL_FAULT_TYPE_STATUS" offset="0x1028" width="8" description="">
		<bitfield id="FAULT_NS" width="1" begin="6" end="6" resetval="0x0" description="Non-secure access." range="6" rwaccess="RO"/> 
		<bitfield id="FAULT_TYPE" width="6" begin="5" end="0" resetval="0x0" description="Fault Type  10_0000 = Supervisor read  fault  - priv = 1 dir = 1 dtype != 1   01_0000 = Supervisor write fault  - priv = 1 dir = 0  00_1000 = Supervisor execute fault - priv = 1 dir = 1 dtype = 1  00_0100 = User read  fault - priv = 0 dir = 1 dtype = 1  00_0010 = User write fault - priv = 0 dir = 0  00_0001 = User execute fault - priv = 0 dir = 1 dtype = 1  00_0000 = No fault" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CTRL_FAULT_ATTR_STATUS" acronym="CONTROLSS_CTRL_FAULT_ATTR_STATUS" offset="0x102C" width="32" description="">
		<bitfield id="FAULT_XID" width="12" begin="31" end="20" resetval="0x0" description="XID." range="31 - 20" rwaccess="RO"/> 
		<bitfield id="FAULT_ROUTEID" width="12" begin="19" end="8" resetval="0x0" description="Route ID." range="19 - 8" rwaccess="RO"/> 
		<bitfield id="FAULT_PRIVID" width="8" begin="7" end="0" resetval="0x0" description="Privilege ID." range="7 - 0" rwaccess="RO"/>
	</register>
	<register id="CONTROLSS_CTRL_FAULT_CLEAR" acronym="CONTROLSS_CTRL_FAULT_CLEAR" offset="0x1030" width="0" description="">
		<bitfield id="FAULT_CLR" width="1" begin="0" end="0" resetval="0x0" description="Fault clear. Writing a 1 clears the current fault. Writing a 0 has no effect." range="0" rwaccess="WO"/>
	</register>
</module>